### Dataframe

The Dataframe is a two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Dataframe is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:

Create Dataframe Using Array

In [8]:
import pandas as pd
import numpy as np

In [9]:
# Creating a DataFrame from a array

data = np.array([["Tom", "Jack", "Steve", "Ricky"], [28, 34, 29, 42]])
ans = pd.DataFrame(data, index=["Name", "Age"], columns=[1, 2, 3, 4])

In [10]:
# Show the dataframe
print(ans)

        1     2      3      4
Name  Tom  Jack  Steve  Ricky
Age    28    34     29     42

#### Creating Data Frame Using Dictionary

In [11]:
Name = [
    "Lokesh Singh",
    "Sonali Kummari",
    "Diwakar Singh",
    "Ritik Srivastav",
    "Aniket Shivhare",
    "Akshay Pathak",
]
Role = [
    "Software Trainer",
    "Developer",
    "Coder and Developer",
    "Speaker",
    "Programmer",
    "Army Officer",
]
Age = [22, 24, 22, 23, 23, 24]

In [12]:
Dict = {"Name": Name, "Age": Age, "Job Title": Role}
# Creating a Dataframe
data = pd.DataFrame(Dict)

In [13]:
# Showing The Dataframe
print(data)

              Name  Age            Job Title
0     Lokesh Singh   22     Software Trainer
1   Sonali Kummari   24            Developer
2    Diwakar Singh   22  Coder and Developer
3  Ritik Srivastav   23              Speaker
4  Aniket Shivhare   23           Programmer
5    Akshay Pathak   24         Army Officer

In [18]:
# Change The Index of dataframe
data = pd.DataFrame(Dict, index=[1, 2, 3, 4, 5, 6])
data

              Name  Age            Job Title
1     Lokesh Singh   22     Software Trainer
2   Sonali Kummari   24            Developer
3    Diwakar Singh   22  Coder and Developer
4  Ritik Srivastav   23              Speaker
5  Aniket Shivhare   23           Programmer
6    Akshay Pathak   24         Army Officer

#### Creating DataFrame Using CSV File

In [19]:
# Reading The CSV File

Read = pd.read_csv("CSV1.csv")

In [23]:
# Show First 5 Rows of CSV File
Read.head()

   S.NO             Name               Role  Id
0     1     Lokesh Singh            Trainer   1
1     2    Diwakar Singh  Coder & Developer   2
2     3    Sonali Kumari  Software Enginner   3
3     4       Vimal Kant              UI/UX   4
4     5  Aniket Shivahre          Developer   5

In [22]:
# Show Last 5 Rows of dataframe
Read.tail()

   S.NO             Name               Role  Id
5     6    Akshay Pathak       Army Officer   6
6     7  Ritik Srivastav            Speaker   7
7     8      Akash Singh  Fronted Developer   8
8     9    Durgesh Singh        Copy Writer   9
9    10   Prakash Pandey       Story Teller  10

In [24]:
# Show Last n rows of Dataframe of CSV File
Read.tail(7)

   S.NO             Name               Role  Id
3     4       Vimal Kant              UI/UX   4
4     5  Aniket Shivahre          Developer   5
5     6    Akshay Pathak       Army Officer   6
6     7  Ritik Srivastav            Speaker   7
7     8      Akash Singh  Fronted Developer   8
8     9    Durgesh Singh        Copy Writer   9
9    10   Prakash Pandey       Story Teller  10

In [25]:
# Getting to the Shape Attribute
Read.shape

(10, 4)

In [29]:
# Display all rows of the Data

# Read The big CSV File
Match_data = pd.read_csv("matches - matches.csv")

# Print The Shape of The CSV File
print(Match_data.shape)

# Print all the rows
pd.set_option("display.max_rows", 636)

# Just Print The dataframe and you will get all the rows

(636, 18)